import React from "react";
import { SvgXml } from "react-native-svg";

const xml = `
  <svg xmlns="http://www.w3.org/2000/svg" width="888" height="1129.97" viewBox="0 0 888 1129.97">
    <g id="그룹_101" data-name="그룹 101" transform="translate(-4913 -3720.03)">
      <circle id="타원_696" data-name="타원 696" cx="444" cy="444" r="444" transform="translate(4913 3962)" fill="#fff"/>
      <g id="그룹_98" data-name="그룹 98" transform="translate(5107 3670)">
        <g id="그룹_23" data-name="그룹 23" transform="translate(188 66.202)">
          <path id="패스_792" data-name="패스 792" d="M618.548,357.334c-11.12-8.314-28.538-16.176-47.786-21.571-17.525-4.912-34.62-7.284-48.136-6.678l-.071-1.572c13.678-.612,30.949,1.779,48.632,6.735,19.428,5.446,37.034,13.4,48.3,21.826Z" transform="translate(-503.394 -305.761)" fill="#ccc"/>
          <g id="그룹_22" data-name="그룹 22" transform="translate(-4 0)">
            <path id="패스_793" data-name="패스 793" d="M593.24,335.766a50.264,50.264,0,0,1-4.169,20.125q-.345.8-.719,1.576c-9.876,20.7-32.4,31.687-54.338,26.5s-37.469-25.17-37.472-48.2q0-1.718.114-3.409.054-.86.14-1.709c2.664-26.186,24.9-45.651,50.6-44.287S593.238,309.439,593.24,335.766Z" transform="translate(-476.505 -286.294)" fill="#f2f2f2"/>
            <path id="패스_794" data-name="패스 794" d="M589.058,429.463q-.344.75-.717,1.487-2.115.222-4.452.323c-1.289.056-2.617.084-3.973.084-11.846,0-26.1-2.115-40.666-6.065-16.231-4.4-30.915-10.559-41.347-17.337q-.533-.346-1.047-.693.054-.811.14-1.613.83.573,1.711,1.146c10.311,6.7,24.847,12.789,40.933,17.152,14.437,3.915,28.558,6.013,40.269,6.013q2.007,0,3.915-.083Q586.6,429.755,589.058,429.463Z" transform="translate(-478.027 -350.322)" opacity="0.1"/>
            <path id="패스_795" data-name="패스 795" d="M563.769,386.133c-12.739,0-28.07-2.383-43.732-6.83-17.454-4.956-33.245-11.889-44.465-19.522-11.455-7.792-16.825-15.469-15.124-21.619s10.229-9.881,24.012-10.506l.069,1.572c-6.436.292-11.682,1.262-15.591,2.881s-6.252,3.8-7,6.479.15,5.785,2.652,9.218,6.493,7.031,11.842,10.67c11.087,7.542,26.72,14.4,44.019,19.313,15.526,4.409,30.711,6.771,43.3,6.771q2.159,0,4.21-.092c6.436-.293,11.682-1.262,15.591-2.881s6.253-3.8,7-6.479c1.333-4.819-2.7-11.08-11.345-17.63l.931-1.26a40.87,40.87,0,0,1,9.792,9.875c2.194,3.411,2.907,6.588,2.118,9.44-1.7,6.15-10.229,9.88-24.012,10.506C566.654,386.1,565.227,386.133,563.769,386.133Z" transform="translate(-460.14 -305.96)" fill="#ccc"/>
          </g>
        </g>
        <text id="DNA" transform="translate(219 96)" fill="#84a9ac" font-size="30" font-family="NanumGothicBold, Nanum Gothic"><tspan x="0" y="28">DNA</tspan></text>
      </g>
      <g id="그룹_99" data-name="그룹 99" transform="translate(5297.939 3836)">
        <g id="그룹_10" data-name="그룹 10" transform="translate(34.682 47.645)">
          <ellipse id="타원_668" data-name="타원 668" cx="21.054" cy="4.737" rx="21.054" ry="4.737" transform="translate(3.879 85.851)" fill="#cae8d5"/>
          <path id="패스_1027" data-name="패스 1027" d="M622.757,215.351c0,13.464-24.379,51.527-24.379,51.527S574,228.814,574,215.351a24.379,24.379,0,0,1,48.757,0Z" transform="translate(-574 -190.972)" fill="#84a9ac"/>
          <circle id="타원_669" data-name="타원 669" cx="13.851" cy="13.851" r="13.851" transform="translate(10.527 10.527)" fill="#f2f2f2"/>
        </g>
      </g>
      <g id="그룹_100" data-name="그룹 100" transform="translate(5143.985 3715.457)">
        <path id="패스_796" data-name="패스 796" d="M250.117,3.8h-3.759V0h-2.017V3.8H240.58V5.841h3.761v3.8h2.017v-3.8h3.759Z" transform="translate(-132.879 4.573)" fill="#ccc"/>
        <path id="패스_1029" data-name="패스 1029" d="M250.117,3.8h-3.759V0h-2.017V3.8H240.58V5.841h3.761v3.8h2.017v-3.8h3.759Z" transform="translate(115.888 211.643)" fill="#ccc"/>
        <ellipse id="타원_619" data-name="타원 619" cx="3.294" cy="3.33" rx="3.294" ry="3.33" transform="translate(315.162 9.394)" fill="#ccc"/>
        <ellipse id="타원_674" data-name="타원 674" cx="3.294" cy="3.33" rx="3.294" ry="3.33" transform="translate(118.592 174.135)" fill="#ccc"/>
        <ellipse id="타원_676" data-name="타원 676" cx="3.294" cy="3.33" rx="3.294" ry="3.33" transform="translate(30.103 83.139)" fill="#ccc"/>
        <path id="패스_1033" data-name="패스 1033" d="M250.117,3.8h-3.759V0h-2.017V3.8H240.58V5.841h3.761v3.8h2.017v-3.8h3.759Z" transform="translate(160.376 33.342)" fill="#ccc"/>
        <ellipse id="타원_677" data-name="타원 677" cx="3.294" cy="3.33" rx="3.294" ry="3.33" transform="translate(413.428 128.143)" fill="#ccc"/>
        <path id="패스_1034" data-name="패스 1034" d="M250.117,3.8h-3.759V0h-2.017V3.8H240.58V5.841h3.761v3.8h2.017v-3.8h3.759Z" transform="translate(-234.565 216.464)" fill="#ccc"/>
      </g>
    </g>
  </svg>
`;

export default () => <SvgXml xml={xml} width="100%" height="100%" />;
